Chapter 1 - How a Data Scientist Beat the Odds
Chapter 2 - A Data Science Framework
Chapter 3 - Step 1: Define the Problem and Step 2: Gather the Data
Chapter 4 - Step 3: Prepare Data for Consumption
Chapter 5 - The 4 C's of Data Cleaning: Correcting, Completing, Creating, and Converting
Chapter 6 - Step 4: Perform Exploratory Analysis with Statistics
Chapter 7 - Step 5: Model Data
Chapter 8 - Evaluate Model Performance
Chapter 9 - Tune Model with Hyper-Parameters
Chapter 10 - Tune Model with Feature Selection
Chapter 11 - Step 6: Validate and Implement
Chapter 12 - Conclusion and Step 7: Optimize and Strategize
Change Log
Credits

In [38]:
import pandas as pd

In [39]:
train=pd.read_csv('data/train.csv')

In [40]:
test=pd.read_csv('data/test.csv')

In [41]:
data_cleaner=[train,test]

In [42]:
print(train.info())
train.sample(10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB
None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
497,498,0,3,"Shellard, Mr. Frederick William",male,NaN,0,0,C.A. 6212,15.1000,NaN,S
657,658,0,3,"Bourke, Mrs. John (Catherine)",female,32.0,1,1,364849,15.5000,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
585,586,1,1,"Taussig, Miss. Ruth",female,18.0,0,2,110413,79.6500,E68,S
317,318,0,2,"Moraweck, Dr. Ernest",male,54.0,0,0,29011,14.0000,NaN,S
382,383,0,3,"Tikkanen, Mr. Juho",male,32.0,0,0,STON/O 2. 3101293,7.9250,NaN,S
788,789,1,3,"Dean, Master. Bertram Vere",male,1.0,1,2,C.A. 2315,20.5750,NaN,S
640,641,0,3,"Jensen, Mr. Hans Peder",male,20.0,0,0,350050,7.8542,NaN,S
692,693,1,3,"Lam, Mr. Ali",male,NaN,0,0,1601,56.4958,NaN,S
594,595,0,2,"Chapman, Mr. John Henry",male,37.0,1,0,SC/AH 29037,26.0000,NaN,S

In [43]:
train.describe(include='all')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Endres, Miss. Caroline Louise",male,NaN,NaN,NaN,CA. 2343,NaN,C23 C25 C27,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [44]:
train_null=train.isnull().sum()
train_null[train_null>0].sort_values(ascending=False)

Cabin       687
Age         177
Embarked      2
dtype: int64

In [45]:
#Clean data

In [46]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [47]:
train=train.drop(['PassengerId'],axis=1)

In [48]:
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [49]:
train=train.drop(['Ticket','Cabin'],axis=1)

In [50]:
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

In [51]:
train=train.drop(['Name'],axis=1)

In [52]:
train['Embarked']=train.Embarked.fillna('S')

In [53]:
train.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [54]:
train.Embarked.value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [55]:
train.Embarked[train['Embarked']=='S']=0
train.Embarked[train['Embarked']=='C']=1
train.Embarked[train['Embarked']=='Q']=2

C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [56]:
train.Embarked.value_counts()

0    646
1    168
2     77
Name: Embarked, dtype: int64

In [57]:
train.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        0
1         1       1  female  38.0      1      0  71.2833        1
2         1       3  female  26.0      0      0   7.9250        0
3         1       1  female  35.0      1      0  53.1000        0
4         0       3    male  35.0      0      0   8.0500        0

In [58]:
train['Family']=train['SibSp']+train['Parch']

In [59]:
train.sample(30)

     Survived  Pclass     Sex   Age  SibSp  Parch      Fare Embarked  Family
277         0       2    male   NaN      0      0    0.0000        0       0
224         1       1    male  38.0      1      0   90.0000        0       1
200         0       3    male  28.0      0      0    9.5000        0       0
835         1       1  female  39.0      1      1   83.1583        1       2
111         0       3  female  14.5      1      0   14.4542        1       1
285         0       3    male  33.0      0      0    8.6625        1       0
736         0       3  female  48.0      1      3   34.3750        0       4
133         1       2  female  29.0      1      0   26.0000        0       1
768         0       3    male   NaN      1      0   24.1500        2       1
8           1       3  female  27.0      0      2   11.1333        0       2
414         1       3    male  44.0      0      0    7.9250        0       0
702         0       3  female  18.0      0      1   14.4542        1       1
832         0       3    male   NaN      0      0    7.2292        1       0
451         0       3    male   NaN      1      0   19.9667        0       1
544         0       1    male  50.0      1      0  106.4250        1       1
228         0       2    male  18.0      0      0   13.0000        0       0
537         1       1  female  30.0      0      0  106.4250        1       0
824         0       3    male   2.0      4      1   39.6875        0       5
777         1       3  female   5.0      0      0   12.4750        0       0
505         0       1    male  18.0      1      0  108.9000        1       1
329         1       1  female  16.0      0      1   57.9792        1       1
708         1       1  female  22.0      0      0  151.5500        0       0
284         0       1    male   NaN      0      0   26.0000        0       0
821         1       3    male  27.0      0      0    8.6625        0       0
214         0       3    male   NaN      1      0    7.7500        2       1
744         1       3    male  31.0      0      0    7.9250        0       0
10          1       3  female   4.0      1      1   16.7000        0       2
623         0       3    male  21.0      0      0    7.8542        0       0
676         0       3    male  24.5      0      0    8.0500        0       0
267         1       3    male  25.0      1      0    7.7750        0       1

In [60]:
train.Family[train['Family']>=1]=1

C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [61]:
train.sample(20)

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked  Family
209         1       1    male  40.0      0      0  31.0000        1       0
468         0       3    male   NaN      0      0   7.7250        2       0
90          0       3    male  29.0      0      0   8.0500        0       0
636         0       3    male  32.0      0      0   7.9250        0       0
79          1       3  female  30.0      0      0  12.4750        0       0
163         0       3    male  17.0      0      0   8.6625        0       0
690         1       1    male  31.0      1      0  57.0000        0       1
695         0       2    male  52.0      0      0  13.5000        0       0
204         1       3    male  18.0      0      0   8.0500        0       0
425         0       3    male   NaN      0      0   7.2500        0       0
566         0       3    male  19.0      0      0   7.8958        0       0
429         1       3    male  32.0      0      0   8.0500        0       0
278         0       3    male   7.0      4      1  29.1250        2       1
485         0       3  female   NaN      3      1  25.4667        0       1
407         1       2    male   3.0      1      1  18.7500        0       1
570         1       2    male  62.0      0      0  10.5000        0       0
275         1       1  female  63.0      1      0  77.9583        0       1
354         0       3    male   NaN      0      0   7.2250        1       0
759         1       1  female  33.0      0      0  86.5000        0       0
401         0       3    male  26.0      0      0   8.0500        0       0

In [62]:
train=train.drop(['SibSp','Parch'],axis=1)

In [63]:
train.head()

   Survived  Pclass     Sex   Age     Fare Embarked  Family
0         0       3    male  22.0   7.2500        0       1
1         1       1  female  38.0  71.2833        1       1
2         1       3  female  26.0   7.9250        0       0
3         1       1  female  35.0  53.1000        0       1
4         0       3    male  35.0   8.0500        0       0

In [64]:
def get_person(passenger):
    age,sex=passenger
    return 'child' if age<16 else sex

In [65]:
train['person']=train[['Age','Sex']].apply(get_person,axis=1)

In [66]:
train.drop(['Sex'],axis=1,inplace=True)

In [67]:
train.head()

   Survived  Pclass   Age     Fare Embarked  Family  person
0         0       3  22.0   7.2500        0       1    male
1         1       1  38.0  71.2833        1       1  female
2         1       3  26.0   7.9250        0       0  female
3         1       1  35.0  53.1000        0       1  female
4         0       3  35.0   8.0500        0       0    male

In [68]:
train.person[train['person']=='male']=0
train.person[train['person']=='female']=1
train.person[train['person']=='child']=2

C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [69]:
train.head()

   Survived  Pclass   Age     Fare Embarked  Family person
0         0       3  22.0   7.2500        0       1      0
1         1       1  38.0  71.2833        1       1      1
2         1       3  26.0   7.9250        0       0      1
3         1       1  35.0  53.1000        0       1      1
4         0       3  35.0   8.0500        0       0      0

In [70]:
train.drop(['Fare'],axis=1,inplace=True)

In [72]:
train.isnull().sum()

Survived      0
Pclass        0
Age         177
Embarked      0
Family        0
person        0
dtype: int64

In [76]:
average_age=train.Age.mean()
std_age=train.Age.std()
count_nan=train.Age.isnull().sum()

In [74]:
average_age

29.69911764705882

In [75]:
std_age

14.526497332334044

In [77]:
count_nan

177

In [ ]:
rand_train=np.random.randint(average_age-std_age,average_age+std_age,size=count_nan)
train.fillna(ra)